towards a more realistic documentation
